wmqScalaTest/out1.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:int="urn:EEC:Interaction:v1.0"><soap:Header>
    <wsa:To>EAEU://BY/CP/P.MM.01/P.MM.01.ACT.001</wsa:To>
    <wsa:ReplyTo>
      <wsa:Address>EAEU://EEC/SR/NSI</wsa:Address>
    </wsa:ReplyTo>
    <wsa:MessageID>urn:uuid:fa611062-f05e-468f-8951-82f55a097305</wsa:MessageID>
    <wsa:RelatesTo>urn:uuid:553c335b-ae68-4c56-8ff3-320fb95561fc</wsa:RelatesTo>
    <wsa:Action>int://CP/P.MM.01/0.1/P.MM.01.PRC.004/P.MM.01.TRN.004/P.MSG.PRS</wsa:Action>
    <int:ConversationID>urn:uuid:bc89fcdf-73c2-4bd9-9c94-afff8eebf1e2</int:ConversationID>
    <int:ProcedureID>urn:uuid:7e4870f0-1eeb-4e4a-832d-0bedf071534f</int:ProcedureID>
  <int:Integration>
                        <int:TrackID>urn:uuid:8ca744a2-3895-4503-9512-4094885479bd</int:TrackID>
                        <int:AcceptTime>2015-08-04T15:54:15+05:00</int:AcceptTime>
                    </int:Integration></soap:Header><soap:Body>
    <sgn:ProcessingReceipt xmlns:sgn="urn:EEC:signal:v1.0">
      <sgn:SignalId>0570c4ba-6a06-4605-bd7e-b1068b549603</sgn:SignalId>
      <sgn:EDocId>2e57d7d1-d819-495f-bdc7-9c1b527abbbc</sgn:EDocId>
      <sgn:DateTime>2015-07-31T15:54:44</sgn:DateTime>
    </sgn:ProcessingReceipt>
  </soap:Body></soap:Envelope>